ackeeblockchain.tools-for-solidity
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dotenv.dotenv-vscode
esbenp.prettier-vscode
github.copilot
github.copilot-chat
inferrinizzard.prettier-sql-vscode
juanblanco.solidity
ms-vscode.js-debug-nightly
nomicfoundation.hardhat-solidity
rbbit.typescript-hero
saurabh.terminal-manager
shd101wyy.markdown-preview-enhanced
